#y=kx+b
# ---------------------------数据获取-------------------------------
xs=[i for i in range(2000,2023)]
ys = [5000, 8000,12000 ,15000,14000,18000,20000,25000,26000,32000,40000,42000,46000,50000,51000,53000,53000,54000,57000,58000,59000,59900,60000]
# ---------------------------数据处理-------------------------------
# min-max归一化
x_min=min(xs)
x_max=max(xs)
y_min=min(ys)
y_max=max(ys)
xs_normal=[(i-x_min)/(x_max-x_min) for i in xs]
ys_normal=[(i-y_min)/(y_max-y_min) for i in ys]

# ---------------------------参数定义
epoch=10000
lr=0.1
k=1
b=1
# ---------------------------模型训练--------------------------------
for e in range(epoch):
    for x,y in zip(xs_normal,ys_normal):
        # ------------------求预测值（模型预测，模型推理）-----------------------
        pre=k*x+b
        # ------------------求loss----------------------
        loss=(pre-y)**2
        # ------------------计算梯度-----------------------
        delta_k=2*(pre-y)*x
        delta_b=2*(pre-y)
        #更新参数
        k=k-delta_k*lr
        b=b-delta_b*lr
        print(loss)
#-------------------------------模型上线及预测---------------------------------
while True:
    input_x=int(input("请输入年份："))
    input_x=(input_x-x_min)/(x_max-x_min)
    p=k*input_x+b
    pp=p*(y_max-y_min)+y_min
    print(pp)